Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
sequence (InputLayer)           [(None, 1048576, 4)] 0                                            
__________________________________________________________________________________________________
stochastic_reverse_complement ( ((None, 1048576, 4), 0           sequence[0][0]                   
__________________________________________________________________________________________________
stochastic_shift (StochasticShi (None, 1048576, 4)   0           stochastic_reverse_complement[0][
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 1048576, 4)   0           stochastic_shift[0][0]           
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 1048576, 96)  4224        re_lu[0][0]                      
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 1048576, 96)  384         conv1d[0][0]                     
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 524288, 96)   0           batch_normalization[0][0]        
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 524288, 96)   0           max_pooling1d[0][0]              
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 524288, 96)   46080       re_lu_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 524288, 96)   384         conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 262144, 96)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 262144, 96)   0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 262144, 96)   46080       re_lu_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 262144, 96)   384         conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 131072, 96)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 131072, 96)   0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 131072, 96)   46080       re_lu_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 131072, 96)   384         conv1d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 65536, 96)    0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 65536, 96)    0           max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 65536, 96)    46080       re_lu_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 65536, 96)    384         conv1d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 32768, 96)    0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 32768, 96)    0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 32768, 96)    46080       re_lu_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32768, 96)    384         conv1d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 16384, 96)    0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 16384, 96)    0           max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 16384, 96)    46080       re_lu_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 16384, 96)    384         conv1d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 8192, 96)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 8192, 96)     0           max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 8192, 96)     46080       re_lu_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 8192, 96)     384         conv1d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, 4096, 96)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 4096, 96)     0           max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 4096, 96)     46080       re_lu_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 4096, 96)     384         conv1d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_8 (MaxPooling1D)  (None, 2048, 96)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 2048, 96)     0           max_pooling1d_8[0][0]            
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 2048, 96)     46080       re_lu_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 2048, 96)     384         conv1d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_9 (MaxPooling1D)  (None, 1024, 96)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 1024, 96)     0           max_pooling1d_9[0][0]            
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 1024, 96)     46080       re_lu_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 1024, 96)     384         conv1d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_10 (MaxPooling1D) (None, 512, 96)      0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 512, 96)      0           max_pooling1d_10[0][0]           
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 512, 48)      13824       re_lu_11[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 512, 48)      192         conv1d_11[0][0]                  
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 512, 48)      0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 512, 96)      4608        re_lu_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 512, 96)      384         conv1d_12[0][0]                  
__________________________________________________________________________________________________
dropout (Dropout)               (None, 512, 96)      0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
add (Add)                       (None, 512, 96)      0           max_pooling1d_10[0][0]           
                                                                 dropout[0][0]                    
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 512, 96)      0           add[0][0]                        
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, None, 48)     13824       re_lu_13[0][0]                   
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, 48)     192         conv1d_13[0][0]                  
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, None, 48)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, None, 96)     4608        re_lu_14[0][0]                   
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, None, 96)     384         conv1d_14[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, 96)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
add_1 (Add)                     (None, 512, 96)      0           add[0][0]                        
                                                                 dropout_1[0][0]                  
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 512, 96)      0           add_1[0][0]                      
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, None, 48)     13824       re_lu_15[0][0]                   
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, None, 48)     192         conv1d_15[0][0]                  
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, None, 48)     0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, None, 96)     4608        re_lu_16[0][0]                   
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, None, 96)     384         conv1d_16[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, None, 96)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
add_2 (Add)                     (None, 512, 96)      0           add_1[0][0]                      
                                                                 dropout_2[0][0]                  
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 512, 96)      0           add_2[0][0]                      
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, None, 48)     13824       re_lu_17[0][0]                   
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, None, 48)     192         conv1d_17[0][0]                  
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 (None, None, 48)     0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, None, 96)     4608        re_lu_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, None, 96)     384         conv1d_18[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, None, 96)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
add_3 (Add)                     (None, 512, 96)      0           add_2[0][0]                      
                                                                 dropout_3[0][0]                  
__________________________________________________________________________________________________
re_lu_19 (ReLU)                 (None, 512, 96)      0           add_3[0][0]                      
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, None, 48)     13824       re_lu_19[0][0]                   
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, None, 48)     192         conv1d_19[0][0]                  
__________________________________________________________________________________________________
re_lu_20 (ReLU)                 (None, None, 48)     0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, None, 96)     4608        re_lu_20[0][0]                   
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, None, 96)     384         conv1d_20[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, None, 96)     0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, 512, 96)      0           add_3[0][0]                      
                                                                 dropout_4[0][0]                  
__________________________________________________________________________________________________
re_lu_21 (ReLU)                 (None, 512, 96)      0           add_4[0][0]                      
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, None, 48)     13824       re_lu_21[0][0]                   
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, None, 48)     192         conv1d_21[0][0]                  
__________________________________________________________________________________________________
re_lu_22 (ReLU)                 (None, None, 48)     0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, None, 96)     4608        re_lu_22[0][0]                   
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, None, 96)     384         conv1d_22[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, None, 96)     0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
add_5 (Add)                     (None, 512, 96)      0           add_4[0][0]                      
                                                                 dropout_5[0][0]                  
__________________________________________________________________________________________________
re_lu_23 (ReLU)                 (None, 512, 96)      0           add_5[0][0]                      
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, None, 48)     13824       re_lu_23[0][0]                   
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, None, 48)     192         conv1d_23[0][0]                  
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 (None, None, 48)     0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, None, 96)     4608        re_lu_24[0][0]                   
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, None, 96)     384         conv1d_24[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, None, 96)     0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
add_6 (Add)                     (None, 512, 96)      0           add_5[0][0]                      
                                                                 dropout_6[0][0]                  
__________________________________________________________________________________________________
re_lu_25 (ReLU)                 (None, 512, 96)      0           add_6[0][0]                      
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, None, 48)     13824       re_lu_25[0][0]                   
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, None, 48)     192         conv1d_25[0][0]                  
__________________________________________________________________________________________________
re_lu_26 (ReLU)                 (None, None, 48)     0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, None, 96)     4608        re_lu_26[0][0]                   
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, None, 96)     384         conv1d_26[0][0]                  
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, None, 96)     0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
add_7 (Add)                     (None, 512, 96)      0           add_6[0][0]                      
                                                                 dropout_7[0][0]                  
__________________________________________________________________________________________________
re_lu_27 (ReLU)                 (None, 512, 96)      0           add_7[0][0]                      
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, 512, 64)      30720       re_lu_27[0][0]                   
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 512, 64)      256         conv1d_27[0][0]                  
__________________________________________________________________________________________________
re_lu_28 (ReLU)                 (None, 512, 64)      0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
switch_reverse (SwitchReverse)  (None, 512, 64)      0           re_lu_28[0][0]                   
                                                                 stochastic_reverse_complement[0][
__________________________________________________________________________________________________
average_to2d (AverageTo2D)      (None, 512, 512, 64) 0           switch_reverse[0][0]             
__________________________________________________________________________________________________
concat_dist2d (ConcatDist2D)    (None, 512, 512, 65) 0           average_to2d[0][0]               
__________________________________________________________________________________________________
re_lu_29 (ReLU)                 (None, 512, 512, 65) 0           concat_dist2d[0][0]              
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 512, 512, 48) 28080       re_lu_29[0][0]                   
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 512, 512, 48) 192         conv2d[0][0]                     
__________________________________________________________________________________________________
symmetrize2d (Symmetrize2D)     (None, 512, 512, 48) 0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
re_lu_30 (ReLU)                 (None, 512, 512, 48) 0           symmetrize2d[0][0]               
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 24) 10368       re_lu_30[0][0]                   
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 512, 512, 24) 96          conv2d_1[0][0]                   
__________________________________________________________________________________________________
re_lu_31 (ReLU)                 (None, 512, 512, 24) 0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 512, 48) 1152        re_lu_31[0][0]                   
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 512, 512, 48) 192         conv2d_2[0][0]                   
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 512, 512, 48) 0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
add_8 (Add)                     (None, 512, 512, 48) 0           symmetrize2d[0][0]               
                                                                 dropout_8[0][0]                  
__________________________________________________________________________________________________
symmetrize2d_1 (Symmetrize2D)   (None, 512, 512, 48) 0           add_8[0][0]                      
__________________________________________________________________________________________________
re_lu_32 (ReLU)                 (None, 512, 512, 48) 0           symmetrize2d_1[0][0]             
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, None, None, 2 10368       re_lu_32[0][0]                   
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, None, None, 2 96          conv2d_3[0][0]                   
__________________________________________________________________________________________________
re_lu_33 (ReLU)                 (None, None, None, 2 0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, None, None, 4 1152        re_lu_33[0][0]                   
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, None, None, 4 192         conv2d_4[0][0]                   
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, None, None, 4 0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
add_9 (Add)                     (None, 512, 512, 48) 0           symmetrize2d_1[0][0]             
                                                                 dropout_9[0][0]                  
__________________________________________________________________________________________________
symmetrize2d_2 (Symmetrize2D)   (None, 512, 512, 48) 0           add_9[0][0]                      
__________________________________________________________________________________________________
re_lu_34 (ReLU)                 (None, 512, 512, 48) 0           symmetrize2d_2[0][0]             
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, None, None, 2 10368       re_lu_34[0][0]                   
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, None, None, 2 96          conv2d_5[0][0]                   
__________________________________________________________________________________________________
re_lu_35 (ReLU)                 (None, None, None, 2 0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, None, None, 4 1152        re_lu_35[0][0]                   
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, None, None, 4 192         conv2d_6[0][0]                   
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, None, None, 4 0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
add_10 (Add)                    (None, 512, 512, 48) 0           symmetrize2d_2[0][0]             
                                                                 dropout_10[0][0]                 
__________________________________________________________________________________________________
symmetrize2d_3 (Symmetrize2D)   (None, 512, 512, 48) 0           add_10[0][0]                     
__________________________________________________________________________________________________
re_lu_36 (ReLU)                 (None, 512, 512, 48) 0           symmetrize2d_3[0][0]             
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, None, None, 2 10368       re_lu_36[0][0]                   
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, None, None, 2 96          conv2d_7[0][0]                   
__________________________________________________________________________________________________
re_lu_37 (ReLU)                 (None, None, None, 2 0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, None, None, 4 1152        re_lu_37[0][0]                   
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, None, None, 4 192         conv2d_8[0][0]                   
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, None, None, 4 0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
add_11 (Add)                    (None, 512, 512, 48) 0           symmetrize2d_3[0][0]             
                                                                 dropout_11[0][0]                 
__________________________________________________________________________________________________
symmetrize2d_4 (Symmetrize2D)   (None, 512, 512, 48) 0           add_11[0][0]                     
__________________________________________________________________________________________________
re_lu_38 (ReLU)                 (None, 512, 512, 48) 0           symmetrize2d_4[0][0]             
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, None, None, 2 10368       re_lu_38[0][0]                   
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, None, None, 2 96          conv2d_9[0][0]                   
__________________________________________________________________________________________________
re_lu_39 (ReLU)                 (None, None, None, 2 0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, None, None, 4 1152        re_lu_39[0][0]                   
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, None, None, 4 192         conv2d_10[0][0]                  
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, None, None, 4 0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
add_12 (Add)                    (None, 512, 512, 48) 0           symmetrize2d_4[0][0]             
                                                                 dropout_12[0][0]                 
__________________________________________________________________________________________________
symmetrize2d_5 (Symmetrize2D)   (None, 512, 512, 48) 0           add_12[0][0]                     
__________________________________________________________________________________________________
re_lu_40 (ReLU)                 (None, 512, 512, 48) 0           symmetrize2d_5[0][0]             
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, None, None, 2 10368       re_lu_40[0][0]                   
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, None, None, 2 96          conv2d_11[0][0]                  
__________________________________________________________________________________________________
re_lu_41 (ReLU)                 (None, None, None, 2 0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, None, None, 4 1152        re_lu_41[0][0]                   
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, None, None, 4 192         conv2d_12[0][0]                  
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, None, None, 4 0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
add_13 (Add)                    (None, 512, 512, 48) 0           symmetrize2d_5[0][0]             
                                                                 dropout_13[0][0]                 
__________________________________________________________________________________________________
symmetrize2d_6 (Symmetrize2D)   (None, 512, 512, 48) 0           add_13[0][0]                     
__________________________________________________________________________________________________
cropping2d (Cropping2D)         (None, 448, 448, 48) 0           symmetrize2d_6[0][0]             
__________________________________________________________________________________________________
upper_triu (UpperTriu)          (None, 99681, 48)    0           cropping2d[0][0]                 
__________________________________________________________________________________________________
dense (Dense)                   (None, 99681, 5)     245         upper_triu[0][0]                 
==================================================================================================
Total params: 751,653
Trainable params: 746,149
Non-trainable params: 5,504
